## Brewfile for icetray
## Users can run `brew bundle` in the directory this file is in and
## Homebrew will install the following packges. When adding new
## packages, please include a comment explaining what the package is
## for.
tap "homebrew/bundle"
tap "icecube/icecube"
# these packages are *required* for icetray on macos
brew "boost-python3"
brew "scipy"
brew "cmake"
brew "libarchive"
brew "zlib"
brew "nlopt"
brew "zstd"
# these packages are *recommended* to get the most out of icetray
brew "pkg-config"
brew "llvm"
brew "ccache"
brew "cdk"
brew "cfitsio"
brew "cppzmq"
brew "fftw"
brew "gsl"
brew "hdf5"
brew "healpix"
brew "metis"
brew "nlopt"
brew "pyqt@5"
brew "suite-sparse"
brew "icecube/icecube/photospline"
brew "icecube/icecube/multinest"
brew "icecube/icecube/pal"
brew "icecube/icecube/sprng2"
# these packages are "nice to have", ie. they make development easier
brew "github-keygen"

